tap "felixkratz/formulae"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "libtiff"
brew "jpeg-xl"
brew "fzf"
brew "arttime"
brew "btop"
brew "glib"
brew "cairo"
brew "cloc"
brew "cmake"
brew "openssl@3"
brew "cryptography"
brew "libgit2"
brew "eza"
brew "gmp"
brew "unbound"
brew "harfbuzz"
brew "leptonica"
brew "python@3.12"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "node"
brew "fx"
brew "gnu-sed"
brew "hatch"
brew "httpie"
brew "httrack"
brew "libyaml"
brew "imap-backup"
brew "jq"
brew "lazygit"
brew "luajit"
brew "luarocks"
brew "mise"
brew "tree-sitter"
brew "neovim"
brew "ninja"
brew "nvm"
brew "pipx"
brew "poetry"
brew "prettier"
brew "python-setuptools"
brew "ripgrep"
brew "rust"
brew "starship"
brew "superfile"
brew "watchman"
brew "yadm"
brew "yarn"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "bitwarden"
cask "devtoys"
cask "font-fira-code-nerd-font"
cask "font-iosevka"
cask "karabiner-elements"
cask "kitty"
cask "mitmproxy"
brew "atuin"
brew "ffmpeg"
