tap "asmvik/formulae", trusted: true
tap "bengerthelorf/tap", "https://github.com/Bengerthelorf/homebrew-tap"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# OpenType text shaping engine
brew "harfbuzz"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Modern, extensible Python project management
brew "hatch"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# YAML Parser
brew "libyaml"
# Backup GMail (or other IMAP) accounts to disk
brew "imap-backup"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Image processing and image analysis library
brew "leptonica"
# Find what models run on your hardware
brew "llmfit"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Array framework for Apple silicon
brew "mlx"
# Run LLMs with MLX
brew "mlx-lm"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Python package management tool
brew "poetry"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Watch files and take action when they change
brew "watchman"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# A tiling window manager for macOS based on binary space partitioning.
brew "asmvik/formulae/yabai", trusted: true
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Desktop password and login vault
cask "bitwarden"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "font-iosevka"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Customize macOS app icons
cask "bengerthelorf/tap/iconchanger", trusted: true
# Keyboard customiser
cask "karabiner-elements"
