tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "btop"
brew "python@3.12"
brew "cloc"
brew "cmake"
brew "eza"
brew "fff"
brew "ffmpeg"
brew "fish"
brew "node"
brew "fx"
brew "fzf"
brew "gnu-sed"
brew "httpie"
brew "jq"
brew "lazygit"
brew "luajit"
brew "luarocks"
brew "tree-sitter"
brew "neovim"
brew "ninja"
brew "nvm"
brew "prettier"
brew "python-setuptools"
brew "ripgrep"
brew "starship"
brew "yadm"
brew "yarn"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "devtoys"
cask "font-fira-code-nerd-font"
cask "karabiner-elements"
cask "kitty"
